
const basePath = '/front/js/';
export const jsConfig = {
  [basePath]: [
    {
      title: 'JS基础',
      collapsable: true,
      children: [
        `${basePath}`, // 默认README文件
        '2022-01-07',
        '2022-01-30',
        '2022-02-15',
        '2022-03-29',
        '2022-05-12',
        '2022-07-12',
        '2022-08-01',
        '2022-08-04'
      ]
    },
    {
      title: 'JS进阶',
      collapsable: true,
      children: [
        `${basePath}Advance`,
        '2022-03-21',
        '2022-04-10',
        '2022-04-13',
        '2022-04-28',
        '2022-05-01',
        '2022-05-02',
        '2022-05-10',
        '2022-05-25',
        '2022-06-15',
        '2022-06-27',
        '2022-07-14',
        '2022-08-12'
      ]
    }
  ]
};
